output/2023-07-30-16-12.log
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.134 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1207000
HTML transferred:       1044000 bytes
Requests per second:    7476.13 [#/sec] (mean)
Time per request:       13.376 [ms] (mean)
Time per request:       0.134 [ms] (mean, across all concurrent requests)
Transfer rate:          8819.50 [Kbytes/sec] received
                        8812.20 kb/s sent
                        17631.70 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       2
Processing:     0   11  16.7      5      94
Waiting:        0   11  16.7      5      94
Total:          0   11  17.1      5      95
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.051 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1207000
HTML transferred:       1044000 bytes
Requests per second:    19629.40 [#/sec] (mean)
Time per request:       5.094 [ms] (mean)
Time per request:       0.051 [ms] (mean, across all concurrent requests)
Transfer rate:          23156.55 [Kbytes/sec] received
                        23137.38 kb/s sent
                        46293.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       4
Processing:     1    4   2.3      3      11
Waiting:        1    4   2.3      3      11
Total:          1    4   3.1      3      14
Benchmark_Config
1000,100,2048
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        2068 bytes

Concurrency Level:      100
Time taken for tests:   0.068 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      2232000 bytes
Total body sent:        2231000
HTML transferred:       2068000 bytes
Requests per second:    14795.96 [#/sec] (mean)
Time per request:       6.759 [ms] (mean)
Time per request:       0.068 [ms] (mean, across all concurrent requests)
Transfer rate:          32250.58 [Kbytes/sec] received
                        32236.13 kb/s sent
                        64486.70 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       4
Processing:     1    6   4.9      5      22
Waiting:        1    6   4.9      5      22
Total:          1    6   5.8      5      25
Benchmark_Config
1000,100,4096
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        4116 bytes

Concurrency Level:      100
Time taken for tests:   0.071 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      4280000 bytes
Total body sent:        4279000
HTML transferred:       4116000 bytes
Requests per second:    14164.31 [#/sec] (mean)
Time per request:       7.060 [ms] (mean)
Time per request:       0.071 [ms] (mean, across all concurrent requests)
Transfer rate:          59202.37 [Kbytes/sec] received
                        59188.54 kb/s sent
                        118390.91 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       4
Processing:     2    6   3.4      6      17
Waiting:        2    6   3.4      6      17
Total:          2    6   4.4      6      21
Benchmark_Config
1000,100,8192
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        8212 bytes

Concurrency Level:      100
Time taken for tests:   0.100 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      8376000 bytes
Total body sent:        8375000
HTML transferred:       8212000 bytes
Requests per second:    10039.25 [#/sec] (mean)
Time per request:       9.961 [ms] (mean)
Time per request:       0.100 [ms] (mean, across all concurrent requests)
Transfer rate:          82117.96 [Kbytes/sec] received
                        82108.15 kb/s sent
                        164226.11 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.2      0       5
Processing:     1    8   4.8      7      28
Waiting:        1    8   4.8      7      28
Total:          1    9   5.4      7      28
Benchmark_Config
1000,100,16384
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        16404 bytes

Concurrency Level:      100
Time taken for tests:   0.173 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      16569000 bytes
Total body sent:        16568000
HTML transferred:       16404000 bytes
Requests per second:    5793.24 [#/sec] (mean)
Time per request:       17.261 [ms] (mean)
Time per request:       0.173 [ms] (mean, across all concurrent requests)
Transfer rate:          93738.46 [Kbytes/sec] received
                        93732.80 kb/s sent
                        187471.26 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0       7
Processing:     3   15  10.9     11      49
Waiting:        3   15  10.9     11      49
Total:          3   15  10.9     12      49
Benchmark_Config
1000,100,32768
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        32788 bytes

Concurrency Level:      100
Time taken for tests:   0.206 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      32953000 bytes
Total body sent:        32952000
HTML transferred:       32788000 bytes
Requests per second:    4847.64 [#/sec] (mean)
Time per request:       20.629 [ms] (mean)
Time per request:       0.206 [ms] (mean, across all concurrent requests)
Transfer rate:          156000.23 [Kbytes/sec] received
                        155995.50 kb/s sent
                        311995.73 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0       6
Processing:     3   18   8.7     16      43
Waiting:        3   18   8.6     16      43
Total:          3   18   8.5     16      43
Benchmark_Config
1000,100,65536
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /Echo/echo
Document Length:        65556 bytes

Concurrency Level:      100
Time taken for tests:   0.222 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      65721000 bytes
Total body sent:        65720000
HTML transferred:       65556000 bytes
Requests per second:    4497.13 [#/sec] (mean)
Time per request:       22.236 [ms] (mean)
Time per request:       0.222 [ms] (mean, across all concurrent requests)
Transfer rate:          288628.84 [Kbytes/sec] received
                        288624.45 kb/s sent
                        577253.29 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.4      0       6
Processing:     5   21   6.8     20      47
Waiting:        3   21   6.8     20      47
Total:          5   21   7.2     20      47